## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.postgres.azurerm_managed_disk.storage will be created
  + resource "azurerm_managed_disk" "storage" {
      + create_option                     = "Empty"
      + disk_iops_read_only               = (known after apply)
      + disk_iops_read_write              = (known after apply)
      + disk_mbps_read_only               = (known after apply)
      + disk_mbps_read_write              = (known after apply)
      + disk_size_gb                      = 32
      + id                                = (known after apply)
      + location                          = "westeurope"
      + logical_sector_size               = (known after apply)
      + max_shares                        = (known after apply)
      + name                              = "md-polinetwork-postgres"
      + network_access_policy             = "AllowAll"
      + optimized_frequent_attach_enabled = false
      + performance_plus_enabled          = false
      + public_network_access_enabled     = true
      + resource_group_name               = "rg-polinetwork"
      + source_uri                        = (known after apply)
      + storage_account_type              = "Premium_LRS"
      + tier                              = "P4"
    }

  # module.postgres.kubernetes_namespace.postgres will be created
  + resource "kubernetes_namespace" "postgres" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "postgres"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.postgres.kubernetes_persistent_volume.storageaks will be created
  + resource "kubernetes_persistent_volume" "storageaks" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "postgres-persistent-volume"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes                     = [
              + "ReadWriteOnce",
            ]
          + capacity                         = {
              + "storage" = "32Gi"
            }
          + persistent_volume_reclaim_policy = "Retain"
          + storage_class_name               = "managed-csi"
          + volume_mode                      = "Filesystem"

          + claim_ref (known after apply)

          + node_affinity (known after apply)

          + persistent_volume_source {
              + csi {
                  + driver        = "disk.csi.azure.com"
                  + volume_handle = (known after apply)
                }
            }
        }
    }

  # module.postgres.kubernetes_persistent_volume_claim.postgres_storage will be created
  + resource "kubernetes_persistent_volume_claim" "postgres_storage" {
      + id               = (known after apply)
      + wait_until_bound = true

      + metadata {
          + generation       = (known after apply)
          + name             = "postgres-pvc"
          + namespace        = "postgres"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + access_modes       = [
              + "ReadWriteOnce",
            ]
          + storage_class_name = "managed-csi"
          + volume_name        = "postgres-persistent-volume"

          + resources {
              + requests = {
                  + "storage" = "32Gi"
                }
            }
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>